app/controllers/groups_controller.rb

  def set_data
    @group_data = GroupDatum.new(params[:group_datum])
    existing_data_item = GroupDatum.find(:first, :conditions=>["group_id=? and group_data_type_id=?", @group_data.group_id, @group_data.group_data_type_id])
    if (!existing_data_item.nil?)
      existing_data_item.description = @group_data.description
      @group_data = existing_data_item
    end
    @group = Group.find(@group_data.group_id)
    if User.can_edit_group?(@group, session[:twitter_name])
      @group_data.save
---
SELECT * FROM `groups` WHERE (name = 'twoups' and parent_id=0) LIMIT 1
INSERT INTO `groups` (`name`, `updated_at`, `parent_id`, `created_at`) VALUES('testgroup', '2009-08-22 02:50:27', 0, '2009-08-22 02:50:27')

  def create
    if (session[:twitter_name].nil? || session[:twitter_name].blank? )
      return
    end

    @group = Group.new(params[:group])
    @group.add_user_by_twitter_name(session[:twitter_name])
    @group.name = Group.filter_hash(@group.name)

    if (@group.parent_id != 0)
      @parent = Group.find(@group.parent_id)
      allowed = User.can_edit_group?(@parent, session[:twitter_name])
    else
      allowed = true
    end

    if allowed
      user = User.find_by_twitter_name(session[:twitter_name])
      if !user.nil?
        @group.creator_id = user.id
      end
      if @group.save
---
SELECT * FROM `users` WHERE (`users`.`twitter_name` = 'asktwoups') LIMIT 1
INSERT INTO `users` (`updated_at`, `twitter_name`, `created_at`) VALUES('2009-08-22 01:21:24', 'asktwoups', '2009-08-22 01:21:24')

  def show
    @group = Group.find_group_from_heirarchy(params[:group_names])
---
SELECT * FROM `groups` WHERE (`groups`.`name` IN ('twoups','mytg')) LIMIT 1